CREATE DATABASE trips;
USE trips;

CREATE TABLE trip (
		trip_id INT PRIMARY KEY AUTO_INCREMENT NOT NULL,
		name VARCHAR(50) NOT NULL,
		city VARCHAR(45) NOT NULL,
        per_diem INT DEFAULT 0,
        date_first DATE,
        date_last DATE
);

INSERT INTO trip(name,city,per_diem,date_first,date_last)
VALUES ("Баранов П.Е.","Москва",700,"2020-01-12","2020-01-17"),
("Абрамова К.А.","Владивосток",450,"2020-01-14","2020-01-27"),
("Семенова И.В.","Москва",700,"2020-01-23","2020-01-31"),
("Ильиных Г.Р.","Владивосток",450,"2020-01-12","2020-02-02"),
("Колесов С.П.","Москва",700,"2020-02-01","2020-02-06"),
("Баранов П.Е.","Москва",700,"2020-02-14","2020-02-22"),
("Абрамова К.А.","Москва",700,"2020-02-23","2020-03-01"),
("Баранов П.Е.","Москва",700,"2020-03-03","2020-03-06"),
("Баранов П.Е.","Новосибирск",450,"2020-03-27","2020-04-12"),
("Семенова И.В.","Санкт-Петербург",700,"2020-03-29","2020-04-05");

SELECT * FROM trip;
