print("Hello world")
print(3+2) #сложение
print(3-2) #вычитание
print(3*2) #умножение
print(3 ** 2) #возведение в степень
print(25 // 5) #сколько в числе 25 есть 5
print(25 % 5) #сколько останеться от деления (26:5 остаток - 1 )

print(23.12 + 56.32) #тип float ( с '.') . Python - УМНЫЙ
print(65+35.67) #тип  integer + float . integer ( без .)

name = input ("Как вас зовут ? ") #добавление переменой
print ("Привет,",name) #применение переменой

print(36//7) #сколько семёрок в числе 136 (Д/З)


